In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({
    'city': ['New York', 'Beiging', 'Paris', 'London', 'Tokyo'],
    'population': [10000, 23467, 7532, 56789, 98234]
})

In [6]:
mean_population = df.groupby('city')['population'].mean().to_dict()

In [7]:
df['city_encoded'] = df['city'].map(mean_population)

In [8]:
df

       city  population  city_encoded
0  New York       10000       10000.0
1   Beiging       23467       23467.0
2     Paris        7532        7532.0
3    London       56789       56789.0
4     Tokyo       98234       98234.0

In [9]:
df[['city', 'city_encoded']]

       city  city_encoded
0  New York       10000.0
1   Beiging       23467.0
2     Paris        7532.0
3    London       56789.0
4     Tokyo       98234.0